me/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-06-21 Mon 16:07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>About Sam</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Samuel T. Wallace">
<link rel="stylesheet" type="text/css" href="../styles.css" />
</head>
<body>
<div id="content">
<h1 class="title">About Sam</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org16d863b">1. Short Bio</a></li>
<li><a href="#org81137f1">2. My Recommandations</a>
<ul>
<li><a href="#orgb5dd027">2.1. Recommended Reading</a></li>
<li><a href="#org1b4849b">2.2. Required Reading</a></li>
<li><a href="#org656ad79">2.3. Recommended Watching</a></li>
<li><a href="#orgc33a443">2.4. Recommended Listening</a></li>
<li><a href="#orgf53b032">2.5. Required Listening</a></li>
<li><a href="#org91f18a1">2.6. Recommended Visiting</a></li>
<li><a href="#orga38355c">2.7. Required Visiting</a></li>
</ul>
</li>
<li><a href="#org1bee575">3. Math</a>
<ul>
<li><a href="#orgbcbcf53">3.1. Math Links</a></li>
</ul>
</li>
<li><a href="#org774b38f">4. Coding</a></li>
<li><a href="#org280b1bb">5. Workstation, Workflow, and Machines</a></li>
</ul>
</div>
</div>


<div id="outline-container-org16d863b" class="outline-2">
<h2 id="org16d863b"><span class="section-number-2">1</span> Short Bio</h2>
<div class="outline-text-2" id="text-1">
<p>
I am a full-time mathematics student, as well as an after-hours programmer.
</p>

<ul class="org-ul">
<li><a href="https://github.com/samueltwallace">My GitHub</a></li>
<li>my email: samueltwallace at gmail . com</li>
<li><a href="./samuel.wallace.gpg">PGP Key</a></li>
</ul>

<p>
I am generally interested:
</p>

<ul class="org-ul">
<li>Math</li>
<li>Physics</li>
<li>Computing and Coding</li>
</ul>


<hr>
</div>
</div>


<div id="outline-container-org81137f1" class="outline-2">
<h2 id="org81137f1"><span class="section-number-2">2</span> My Recommandations</h2>
<div class="outline-text-2" id="text-2">
<p>
Here are things I think other people should be exposed to.
</p>
</div>

<div id="outline-container-orgb5dd027" class="outline-3">
<h3 id="orgb5dd027"><span class="section-number-3">2.1</span> Recommended Reading</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><i>Procession of the Black Sloth</i> by Laird Barron (Horror)</li>
<li><i>The Frolic</i> by Thomas Ligotti (Horror)</li>
<li><i>The Last Feast of the Harlequin</i> by Thomas Ligotti (Horror)</li>
<li><i>The Troubles of Dr. Thoss</i> by Thomas Ligotti (Horror)</li>
<li><i>Foundation</i> Trilogy by Isaac Asimov (Far Future Sci-fi, society, history, technology)</li>
<li>Most anything by Stephen King (Horror, the human experience)</li>
</ul>
</div>
</div>

<div id="outline-container-org1b4849b" class="outline-3">
<h3 id="org1b4849b"><span class="section-number-3">2.2</span> Required Reading</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><i>Dune</i> by Frank Herbert (Far-future Sci-fi, worldbuilding, cultures/society)<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></li>
<li><i>Malazan Book of the Fallen</i> by Steven Erickson (High fantasy, wordbuilding, politics, power, religion, history, truth)<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></li>
<li><i>Prose Edda</i> by Snori Sturlusson (History, mythology, anthropology)</li>
<li><i>The Call of Cthulhu</i> by H.P. Lovecraft (horror)<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></li>
</ul>
</div>
</div>


<div id="outline-container-org656ad79" class="outline-3">
<h3 id="org656ad79"><span class="section-number-3">2.3</span> Recommended Watching</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><i>A Beautiful Mind</i></li>
<li><i>Shawshank Redemption</i></li>
<li><i>Howl's Moving Castle</i></li>
</ul>
</div>
</div>

<div id="outline-container-orgc33a443" class="outline-3">
<h3 id="orgc33a443"><span class="section-number-3">2.4</span> Recommended Listening</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><i>Soon it will be Cold Enough</i> by Emancipator (New Age, Instrumental, Chill)</li>
<li><i>Late Registration</i> by Kanye West (Hip hop)</li>
<li><i>Tetsuo and Youth</i> by Lupe Fiasco (Hip hop)</li>
<li><i>Worlds</i> by Porter Robinson (Electronic)</li>
</ul>
</div>
</div>



<div id="outline-container-orgf53b032" class="outline-3">
<h3 id="orgf53b032"><span class="section-number-3">2.5</span> Required Listening</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li><i>The Wall</i> by Pink Floyd (Prog/Classic Rock)<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></li>
<li><i>Bloom</i> by Caligula's Horse (Progressive Metal)</li>
<li>Acts I-V of The Dear Hunter (Prog Rock/Metal)<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup></li>
<li><i>The Mountain</i> by Haken (Progressive Metal)</li>
</ul>
</div>
</div>


<div id="outline-container-org91f18a1" class="outline-3">
<h3 id="org91f18a1"><span class="section-number-3">2.6</span> Recommended Visiting</h3>
<div class="outline-text-3" id="text-2-6">
<ul class="org-ul">
<li><a href="https://lobste.rs">Lobsters</a></li>
</ul>
</div>
</div>


<div id="outline-container-orga38355c" class="outline-3">
<h3 id="orga38355c"><span class="section-number-3">2.7</span> Required Visiting</h3>
<div class="outline-text-3" id="text-2-7">
<ul class="org-ul">
<li><a href="https://lesswrong.com/codex">Less Wrong's The Codex</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org1bee575" class="outline-2">
<h2 id="org1bee575"><span class="section-number-2">3</span> Math</h2>
<div class="outline-text-2" id="text-3">
<p>
I am currently interested in the following:
</p>

<ul class="org-ul">
<li>Partial Differential Equations</li>
<li>Functional Analysis</li>
<li>Variational Problems and Elasticity</li>
</ul>

<p>
I consider myself laragely an applied mathematician.
</p>
</div>

<div id="outline-container-orgbcbcf53" class="outline-3">
<h3 id="orgbcbcf53"><span class="section-number-3">3.1</span> Math Links</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://www.uni-muenster.de/Physik.TP/~munsteg/arnold.html">On Teaching Mathematics,</a> by Vladimir Arnold</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org774b38f" class="outline-2">
<h2 id="org774b38f"><span class="section-number-2">4</span> Coding</h2>
<div class="outline-text-2" id="text-4">
<p>
I have coded in the following languages (listed in the order I remember them):
</p>

<ul class="org-ul">
<li>Java</li>
<li>Python</li>
<li>C</li>
<li>Go</li>
<li>MATLAB</li>
<li>Julia</li>
</ul>

<p>
I wouldn't call myself proficient in any particular language; I don't often stick on one language enough to know it very well (which is a flaw in my learning pattern). I code for fun, and for work (summer internship).
</p>
</div>
</div>

<div id="outline-container-org280b1bb" class="outline-2">
<h2 id="org280b1bb"><span class="section-number-2">5</span> Workstation, Workflow, and Machines</h2>
<div class="outline-text-2" id="text-5">
<p>
I currently do everything off two laptops (one for work, one for personal). They are both 5+ years old, and run great. I use an Ergodox keyboard and a Ducky One Mini 2 when I need it. I also have a Kenting writing tablet for the online teaching I did.
</p>

<p>
On my personal laptop, I use XMonad (though I know very little Haskell) and do text editing in Emacs. On my work machine, I use spectrwm and again Emacs. Both run Arch Linux, and my personal laptop runs Windows as well.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
"Deep in the human unconscious is a pervasive need for a logical universe that makes sense. But the real universe is always one step beyond logic."
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
"The more civilized a nation, the more conformed its population, until that civilization's last age arrives, when multiplicity wages war with conformity. The former grows ever wilder, ever more dysfunctional in its extremities; whilst the latter seeks to increase its measure of control, until such efforts acquire diabolical tyranny."
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
"We live on a placid island of ignorance in the midst of black seas of infinity, and it was not meant that we should voyage far."
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
"Did you ever wonder why we had to run for shelter when the promise of a brave new world unfurled beneath a clear blue sky?"
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
"And all the lessons learned / Were they worth the ash from all the bridges burned?"
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Samuel T. Wallace</p>
<p class="date">Created: 2021-06-21 Mon 16:07</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
